import random

def game():
    загадане_число = random.randint(0, 1000)
    спроба = 0
    
    print("Попробуйте вгадати число від 0 до 1000")
    
    while True:
        спроба += 1
        введене_число = int(input("Ваш варіант: "))
        
        if введене_число < загадане_число:
            print("Ваше число менше за загадане")
        elif введене_число > загадане_число:
            print("Ваше число більше за загадане")
        else:
            print(f"Ви вгадали число {загадане_число} за {спроба} спроб!")
            break

game()
